; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-4-19)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl6)
	(at plane2 city1)
	(fuel-level plane2 fl1)
	(at plane3 city13)
	(fuel-level plane3 fl3)
	(at plane4 city6)
	(fuel-level plane4 fl4)
	(at person1 city4)
	(at person2 city8)
	(at person3 city10)
	(at person4 city10)
	(at person5 city6)
	(at person6 city9)
	(at person7 city11)
	(at person8 city13)
	(at person9 city2)
	(at person10 city11)
	(at person11 city11)
	(at person12 city8)
	(at person13 city11)
	(at person14 city6)
	(at person15 city11)
	(at person16 city3)
	(at person17 city6)
	(at person18 city2)
	(at person19 city8)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city2)
	(at person2 city8)
	(at person3 city8)
	(at person4 city4)
	(at person5 city0)
	(at person6 city5)
	(at person7 city1)
	(at person8 city3)
	(at person9 city13)
	(at person10 city0)
	(at person11 city4)
	(at person12 city13)
	(at person13 city10)
	(at person14 city6)
	(at person15 city13)
	(at person17 city6)
	(at person18 city6)
	(at person19 city8)
	))

)

; plan
1. (board person5 plane4 city6)
   deleted: (at person5 city6)
   added: (in person5 plane4)
   goals met: 4 of 18
2. (zoom plane4 city6 city0 fl4 fl3 fl2)
   deleted: (at plane4 city6) (fuel-level plane4 fl4)
   added: (at plane4 city0) (fuel-level plane4 fl2)
   goals met: 4 of 18
3. (debark person5 plane4 city0)
   deleted: (in person5 plane4)
   added: (at person5 city0)
   goals met: 5 of 18
4. (board person8 plane3 city13)
   deleted: (at person8 city13)
   added: (in person8 plane3)
   goals met: 5 of 18
5. (zoom plane3 city13 city3 fl3 fl2 fl1)
   deleted: (at plane3 city13) (fuel-level plane3 fl3)
   added: (at plane3 city3) (fuel-level plane3 fl1)
   goals met: 5 of 18
6. (debark person8 plane3 city3)
   deleted: (in person8 plane3)
   added: (at person8 city3)
   goals met: 6 of 18
7. (zoom plane1 city0 city10 fl6 fl5 fl4)
   deleted: (at plane1 city0) (fuel-level plane1 fl6)
   added: (at plane1 city10) (fuel-level plane1 fl4)
   goals met: 6 of 18
8. (zoom plane1 city10 city11 fl4 fl3 fl2)
   deleted: (at plane1 city10) (fuel-level plane1 fl4)
   added: (at plane1 city11) (fuel-level plane1 fl2)
   goals met: 6 of 18
9. (board person7 plane1 city11)
   deleted: (at person7 city11)
   added: (in person7 plane1)
   goals met: 6 of 18
10. (board person15 plane1 city11)
   deleted: (at person15 city11)
   added: (in person15 plane1)
   goals met: 6 of 18
11. (board person13 plane1 city11)
   deleted: (at person13 city11)
   added: (in person13 plane1)
   goals met: 6 of 18
12. (board person11 plane1 city11)
   deleted: (at person11 city11)
   added: (in person11 plane1)
   goals met: 6 of 18
13. (board person10 plane1 city11)
   deleted: (at person10 city11)
   added: (in person10 plane1)
   goals met: 6 of 18
14. (zoom plane1 city11 city0 fl2 fl1 fl0)
   deleted: (at plane1 city11) (fuel-level plane1 fl2)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 6 of 18
15. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 6 of 18
16. (debark person10 plane1 city0)
   deleted: (in person10 plane1)
   added: (at person10 city0)
   goals met: 7 of 18
17. (fly plane1 city0 city1 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 7 of 18
18. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 7 of 18
19. (debark person7 plane1 city1)
   deleted: (in person7 plane1)
   added: (at person7 city1)
   goals met: 8 of 18
20. (fly plane1 city1 city10 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city10) (fuel-level plane1 fl0)
   goals met: 8 of 18
21. (refuel plane1 city10 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 8 of 18
22. (board person4 plane1 city10)
   deleted: (at person4 city10)
   added: (in person4 plane1)
   goals met: 8 of 18
23. (board person3 plane1 city10)
   deleted: (at person3 city10)
   added: (in person3 plane1)
   goals met: 8 of 18
24. (debark person13 plane1 city10)
   deleted: (in person13 plane1)
   added: (at person13 city10)
   goals met: 9 of 18
25. (fly plane1 city10 city4 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 9 of 18
26. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 18
27. (debark person4 plane1 city4)
   deleted: (in person4 plane1)
   added: (at person4 city4)
   goals met: 10 of 18
28. (debark person11 plane1 city4)
   deleted: (in person11 plane1)
   added: (at person11 city4)
   goals met: 11 of 18
29. (board person1 plane1 city4)
   deleted: (at person1 city4)
   added: (in person1 plane1)
   goals met: 11 of 18
30. (fly plane2 city1 city2 fl1 fl0)
   deleted: (at plane2 city1) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 11 of 18
31. (board person9 plane2 city2)
   deleted: (at person9 city2)
   added: (in person9 plane2)
   goals met: 11 of 18
32. (refuel plane2 city2 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 18
33. (board person18 plane2 city2)
   deleted: (at person18 city2)
   added: (in person18 plane2)
   goals met: 11 of 18
34. (fly plane2 city2 city13 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city13) (fuel-level plane2 fl0)
   goals met: 11 of 18
35. (refuel plane2 city13 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 11 of 18
36. (debark person9 plane2 city13)
   deleted: (in person9 plane2)
   added: (at person9 city13)
   goals met: 12 of 18
37. (fly plane2 city13 city6 fl1 fl0)
   deleted: (at plane2 city13) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 12 of 18
38. (debark person18 plane2 city6)
   deleted: (in person18 plane2)
   added: (at person18 city6)
   goals met: 13 of 18
39. (fly plane3 city3 city8 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl1)
   added: (at plane3 city8) (fuel-level plane3 fl0)
   goals met: 13 of 18
40. (board person12 plane3 city8)
   deleted: (at person12 city8)
   added: (in person12 plane3)
   goals met: 13 of 18
41. (refuel plane3 city8 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 13 of 18
42. (fly plane3 city8 city13 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city13) (fuel-level plane3 fl0)
   goals met: 13 of 18
43. (debark person12 plane3 city13)
   deleted: (in person12 plane3)
   added: (at person12 city13)
   goals met: 14 of 18
44. (zoom plane4 city0 city9 fl2 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl2)
   added: (at plane4 city9) (fuel-level plane4 fl0)
   goals met: 14 of 18
45. (board person6 plane4 city9)
   deleted: (at person6 city9)
   added: (in person6 plane4)
   goals met: 14 of 18
46. (refuel plane4 city9 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 14 of 18
47. (fly plane4 city9 city5 fl1 fl0)
   deleted: (at plane4 city9) (fuel-level plane4 fl1)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 14 of 18
48. (debark person6 plane4 city5)
   deleted: (in person6 plane4)
   added: (at person6 city5)
   goals met: 15 of 18
49. (fly plane1 city4 city13 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city13) (fuel-level plane1 fl0)
   goals met: 15 of 18
50. (refuel plane1 city13 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 15 of 18
51. (debark person15 plane1 city13)
   deleted: (in person15 plane1)
   added: (at person15 city13)
   goals met: 16 of 18
52. (fly plane1 city13 city2 fl1 fl0)
   deleted: (at plane1 city13) (fuel-level plane1 fl1)
   added: (at plane1 city2) (fuel-level plane1 fl0)
   goals met: 16 of 18
53. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 16 of 18
54. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (at person1 city2)
   goals met: 17 of 18
55. (fly plane1 city2 city8 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city8) (fuel-level plane1 fl0)
   goals met: 17 of 18
56. (debark person3 plane1 city8)
   deleted: (in person3 plane1)
   added: (at person3 city8)
   goals met: 18 of 18
